# Выведите сообщение, если введённая строка пользователя совпадает с 'Hi'.
# Пусть программа всегда в конце выводит слово 'Goodbye'

s = input('Please enter something:\n')
if s == 'Hi':
    print('It\'s "Hi"! Awesome!')
print('Goodbye')